{
  "backend/main.mo": "Main backend actor implementing file upload/download with chunking, user profiles, access control, and share functionality with a 20MB file size limit and 500KB chunk size.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: increasing file upload limit to 20MB, adding warning for files over 15MB, and updating UI text to reflect new 20MB limit.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing components for authentication, file upload with 20MB limit and 15MB warning, shared layouts with branding assets, and routing structure.",
  "frontend/index.css": "Empty CSS file (content truncated or not present).",
  "frontend/index.html": "HTML entry point with LookyLoo title, favicon reference, and root div for React mounting.",
  "frontend/src/App.tsx": "React app root with TanStack Router setup defining routes for upload, my-uploads, and share pages with AuthGate protection and theme provider.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard component that shows login card with animated LookyLoo video and messaging for unauthenticated users, or renders children for authenticated users.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity with loading states, query cache clearing on logout, and 'Sign in or create IID2' text.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog prompting new users to enter their display name on first login with non-dismissible UI and loading state handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper with header containing logo, navigation buttons, login button, profile setup modal, and footer with GeekGoat branding and social links.",
  "frontend/src/components/upload/KeyfilePicker.tsx": "Empty or minimal component file for Arweave keyfile selection (content not provided).",
  "frontend/src/components/uploads/UploadsList.tsx": "React component that displays a list of uploaded files with metadata (filename, size, type, date, downloads), provides copy-to-clipboard share links, delete confirmation dialogs, and navigation to file details.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creates authenticated or anonymous actors based on Internet Identity, initializes access control with admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for backend operations including user profile management, chunked file uploads (500KB chunks), fetching uploads, file metadata retrieval, chunk fetching, download count incrementing, and file deletion.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements (background, foreground, primary, secondary, muted, destructive, borders, charts) using OKLCH color space.",
  "frontend/src/lib/arweaveClient.ts": "Empty file, likely a placeholder for future Arweave blockchain integration client.",
  "frontend/src/lib/shareLinks.ts": "Utility function that generates shareable URLs for files by combining the current origin with a share ID path.",
  "frontend/src/lib/utils.ts": "Utility functions including cn() for merging Tailwind classes with clsx and twMerge, and formatBytes() for human-readable file size formatting.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/MyUploadsPage.tsx": "Page component displaying the authenticated user's uploaded files in a card layout with loading states, error handling, and delete functionality using the UploadsList component.",
  "frontend/src/pages/SharePage.tsx": "Public file sharing page that fetches file metadata and chunks by ID, reassembles chunks into a blob for preview (images/videos), provides download functionality, and increments download counter.",
  "frontend/src/pages/UploadPage.tsx": "React component for file upload page with drag-and-drop, progress tracking, and share link generation. Enforces 20MB max file size and shows warnings for files over 15MB.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme settings, typography and animation plugins.",
  "project_state.json": "Project metadata tracking completed features (20MB upload limit, 15MB warning, UI text updates) and pending backend chunk size handling improvements."
}