{
  "backend/main.mo": "Main backend actor implementing file upload/download with chunking, user profiles, access control via mixins, and share link management with permissions checking throughout.",
  "feature_evidence.json": "Feature evidence report documenting that share link generation file ID format matching is implemented in useQueries.ts and SharePage.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend source files including components, pages, hooks, and configuration files.",
  "frontend/index.css": "Empty CSS file (content appears to be moved to frontend/src/index.css based on summaries).",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Arweave Share application.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for upload, my-uploads, and share pages, wrapping authenticated routes with AuthGate and providing theme/toast support.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard component that displays a login prompt for unauthenticated users and shows loading states during initialization.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states, query cache clearing on logout, and error handling for duplicate authentication.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Non-dismissible modal dialog prompting authenticated users without profiles to enter their name, with form submission handling and loading states.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component with sticky header navigation, login button, profile setup modal, and footer with attribution links.",
  "frontend/src/components/upload/KeyfilePicker.tsx": "Empty component file (likely removed or not yet implemented based on empty content).",
  "frontend/src/components/uploads/UploadsList.tsx": "Reusable component displaying file metadata cards with icons, formatted dates/sizes, copy share link, view, and delete actions with confirmation dialog, plus empty state.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient, managing identity state and delegation validation across the application.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for all backend operations including user profiles, file uploads (metadata, chunks, finalization), retrieving uploads, and fetching file metadata with support for both authenticated and shared file access.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using OKLCH color space, defining design tokens for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/src/lib/arweaveClient.ts": "Empty file, likely a placeholder for future Arweave blockchain integration.",
  "frontend/src/lib/shareLinks.ts": "Utility function that generates shareable URLs for files by combining the current origin with a share ID path.",
  "frontend/src/lib/utils.ts": "Utility functions including a Tailwind class name merger (cn) and a byte formatter that converts numeric byte values to human-readable sizes (KB, MB, GB, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/MyUploadsPage.tsx": "Page component displaying a user's uploaded files with delete functionality, showing loading skeletons and error states using shadcn/ui components.",
  "frontend/src/pages/SharePage.tsx": "Public file sharing page that fetches file metadata and chunks by ID, reassembles the file for preview (images/videos), and provides download functionality with download count tracking.",
  "frontend/src/pages/UploadPage.tsx": "File upload page with validation (images/videos only, 2MB max), chunked upload progress tracking (500KB chunks), automatic file sharing after upload, and shareable link generation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography, container queries, animations, and design tokens for a component-based UI system.",
  "project_state.json": "Project metadata tracking a file sharing application bug where uploaded files return 'File not found' errors when accessed via share links, with pending fix requests for file storage, retrieval, and access permissions."
}