{
  "backend/main.mo": "Main backend actor implementing file upload/download with chunked storage, user profiles, access control via mixins, and file metadata management including sharing and download tracking.",
  "feature_evidence.json": "Feature evidence report documenting three features: removing file type restrictions on upload, updating UI messaging for any file type, and handling non-media file previews on the share page.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing the React app structure, components, pages, hooks, and styling with details about authentication, file upload/sharing, and UI elements.",
  "frontend/index.css": "Empty CSS file (content truncated or removed).",
  "frontend/index.html": "HTML entry point with LookyLoo title, favicon reference, and script tag loading the React app from main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for upload, my-uploads, and share pages, wrapped in ThemeProvider with AuthGate protection and toast notifications.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard component that displays a login card with animated video and messaging when user is not authenticated, otherwise renders protected children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity with loading states, query cache clearing on logout, and updated sign-in text.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog prompting new authenticated users to enter their display name, with form submission handling and no close button to enforce completion.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component with header (logo, navigation, login button), footer (GeekGoat logo and social links), and outlet for page content, plus ProfileSetupModal integration.",
  "frontend/src/components/upload/KeyfilePicker.tsx": "Empty component file (content not provided or removed).",
  "frontend/src/components/uploads/UploadsList.tsx": "React component that displays a list of uploaded files with metadata, share links, and delete functionality. Includes empty state UI and file type icons for images, videos, and documents.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, handling authentication state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile management, file uploads with chunking (500KB chunks), file metadata retrieval, and download functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including primary, secondary, muted, destructive, and chart color definitions.",
  "frontend/src/lib/arweaveClient.ts": "Empty file, likely placeholder for Arweave blockchain integration client.",
  "frontend/src/lib/shareLinks.ts": "Utility function that generates shareable URLs for files by combining the current origin with a share ID path.",
  "frontend/src/lib/utils.ts": "Utility functions including cn() for merging Tailwind classes and formatBytes() for human-readable file size formatting.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/MyUploadsPage.tsx": "Page component displaying the authenticated user's uploaded files with loading states, error handling, and delete functionality using UploadsList component.",
  "frontend/src/pages/SharePage.tsx": "Public file sharing page that fetches file metadata and chunks by ID, reassembles chunked files into blobs for preview/download, and tracks download counts.",
  "frontend/src/pages/UploadPage.tsx": "React component for file upload page with drag-and-drop support, 2MB file size limit, progress tracking, and share link generation after successful upload.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking completed features for removing file type restrictions and updating UI to support any file type uploads beyond just media files."
}