{
  "backend/main.mo": "Main Motoko actor implementing file upload/download with chunked storage, user profiles, access control via mixins, and share functionality with 20MB file size limit and 500KB chunks.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing detailed summaries of all frontend source files including components, pages, hooks, and configuration.",
  "frontend/index.css": "Empty CSS file (no content).",
  "frontend/index.html": "HTML entry point with LookyLoo title, favicon reference, and script tag loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for upload, my-uploads, and share pages, wrapped in ThemeProvider with AuthGate protection.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard component that displays login card with animated LookyLoo video for unauthenticated users or renders children for authenticated users.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity with loading states, query cache clearing on logout, and \"Sign in or create IID2\" text.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog prompting new authenticated users to enter their display name with non-dismissible UI (showCloseButton=false).",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component with header containing logo, navigation buttons, login button, profile setup modal, and footer with GeekGoat image and social links.",
  "frontend/src/components/upload/KeyfilePicker.tsx": "Empty component file (no content).",
  "frontend/src/components/uploads/UploadsList.tsx": "Reusable list component displaying file metadata cards with icons, file info, copy link, view, and delete actions plus empty state with navigation to upload page.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for all backend operations including user profile management, file uploads with chunking (500KB chunks), file metadata retrieval, chunk fetching, download counting, and file deletion.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using OKLCH color space.",
  "frontend/src/lib/arweaveClient.ts": "Empty file, likely a placeholder for future Arweave blockchain integration.",
  "frontend/src/lib/shareLinks.ts": "Utility function that generates shareable links for files using the current origin and a share ID.",
  "frontend/src/lib/utils.ts": "Utility functions including className merging with clsx/tailwind-merge and byte formatting for human-readable file sizes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/pages/MyUploadsPage.tsx": "Page component displaying user's uploaded files with management capabilities including viewing, sharing, and deletion with loading states and error handling.",
  "frontend/src/pages/SharePage.tsx": "Public file sharing page that fetches file metadata and chunks by ID, reassembles the file for preview (images/videos), and provides download functionality with download count tracking.",
  "frontend/src/pages/UploadPage.tsx": "File upload page with drag-and-drop interface, file size validation (20MB max), progress tracking, and share link generation after successful upload with warnings for large files.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, typography, animations, and extended theme utilities.",
  "project_state.json": "Project metadata tracking a rollback request from Version 22 to Version 21 due to an 'Actor not available' error that prevented file uploads."
}