{
  "backend/main.mo": "Main backend actor implementing file upload/download with chunked storage, user profiles, access control via mixins, and file metadata management including sharing and download tracking.",
  "feature_evidence.json": "Feature evidence report documenting four completed branding changes replacing 'Arweave' with 'LookyLoo' across login page, titles, and button text with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose, including updated branding to 'LookyLoo', authentication flows, upload/share pages, and styling configuration.",
  "frontend/index.css": "Empty CSS file (content removed or relocated).",
  "frontend/index.html": "HTML entry point with page title set to 'LookyLoo' and script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for upload, my-uploads, and public share pages, wrapped in theme provider with authentication gates.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard component displaying 'LookyLoo - Frictionless File Share by GeekDice' login card with updated messaging about IID2 sign-in for unauthenticated users.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component with 'Sign in or create IID2' text, handling Internet Identity authentication and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog prompting new users to enter their display name on first login with non-dismissible UI and loading states.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper with 'LookyLoo' header branding, navigation buttons for upload/my-uploads, login button, profile setup modal, and footer with caffeine.ai attribution.",
  "frontend/src/components/upload/KeyfilePicker.tsx": "Empty component file (no content provided).",
  "frontend/src/components/uploads/UploadsList.tsx": "React component that displays a list of uploaded files with metadata, share links, and delete functionality. Shows empty state when no uploads exist and provides copy-to-clipboard for share links.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, handling authentication state and initializing access control with admin token. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, providing login/logout functionality and identity state management. Creates and manages AuthClient with configurable options for delegation and idle handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile management, file uploads (metadata, chunks, finalization), fetching uploads, and retrieving file metadata with support for both authenticated and shared file access.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like backgrounds, borders, primary/secondary colors, and chart colors.",
  "frontend/src/lib/arweaveClient.ts": "Empty file, likely placeholder for Arweave blockchain integration client.",
  "frontend/src/lib/shareLinks.ts": "Utility function that generates shareable URLs for files by combining the current origin with a share ID path.",
  "frontend/src/lib/utils.ts": "Utility functions including cn() for merging Tailwind classes and formatBytes() for converting byte sizes to human-readable format (KB, MB, GB, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/MyUploadsPage.tsx": "Page component displaying user's uploaded files with loading states, error handling, and delete functionality using UploadsList component.",
  "frontend/src/pages/SharePage.tsx": "Public file sharing page that fetches file metadata and chunks by ID, reassembles chunks into downloadable files, and provides preview for images/videos with download tracking.",
  "frontend/src/pages/UploadPage.tsx": "React component for uploading media files (images/videos up to 2MB) with chunked upload, progress tracking, file sharing, and shareable link generation using Internet Computer backend mutations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for typography, animations, and design tokens for a modern UI component system.",
  "project_state.json": "Project metadata defining LookyLoo as a frictionless media sharing app using Internet Identity authentication, tracking completed rebranding features from 'Arweave' to 'LookyLoo' with architectural notes about wallet-free recipient access."
}