{
  "backend/main.mo": "Main actor implementing file upload/download with chunking, user profiles, access control, and file sharing functionality using persistent maps and authorization mixins.",
  "backend/migration.mo": "Migration module that converts old FileMetadata schema (with arweaveId) to new schema (with isShared flag) and initializes empty fileChunks and chunkInfos maps.",
  "feature_evidence.json": "Feature evidence report documenting removal of Arweave functionality, addition of ICP chunked uploads with progress, shareable links, and enhanced MyUploadsPage display.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend source files including components, pages, hooks, and utilities.",
  "frontend/index.css": "Empty CSS file (content removed or moved).",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'Arweave Share'.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for upload, my-uploads, and public share pages, wrapped in ThemeProvider with AuthGate protection.",
  "frontend/src/components/auth/AuthGate.tsx": "Route guard component that displays authentication prompt with Internet Identity login button for unauthenticated users, otherwise renders children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity hook with loading states, query cache clearing on logout, and error handling for duplicate authentication.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog prompting new users to enter their name on first login, with form submission to save profile and no close button to enforce completion.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper with sticky header navigation (Upload/My Uploads links, LoginButton), ProfileSetupModal, main content outlet, and footer with attribution.",
  "frontend/src/components/upload/KeyfilePicker.tsx": "Empty file (Arweave keyfile picker component removed).",
  "frontend/src/components/uploads/UploadsList.tsx": "React component that displays a list of uploaded files with metadata (filename, size, type, upload date, download count), provides actions to copy share links, view files, and delete them via an alert dialog.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origins.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile management, file uploads (metadata, chunks, finalization), fetching uploads/metadata/chunks, and file sharing/deletion with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements (background, foreground, primary, secondary, destructive, borders, charts) using oklch color space.",
  "frontend/src/lib/arweaveClient.ts": "Empty file, likely a placeholder for future Arweave blockchain integration.",
  "frontend/src/lib/shareLinks.ts": "Utility function that generates shareable URLs for files by combining the current origin with a share ID path.",
  "frontend/src/lib/utils.ts": "Utility functions including `cn` for merging Tailwind classes with clsx and `formatBytes` for converting byte counts to human-readable file sizes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/MyUploadsPage.tsx": "Page component displaying user's uploaded files in a card layout with loading states, error handling, and delete functionality using the UploadsList component.",
  "frontend/src/pages/SharePage.tsx": "Page component for viewing shared files by ID, displaying file metadata, reassembling chunks into a blob for preview (images/videos), and providing download functionality with download count tracking.",
  "frontend/src/pages/UploadPage.tsx": "React component for uploading images/videos up to 2MB with chunked upload (500KB chunks), progress tracking, file validation, and shareable link generation after successful upload.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, typography and container query plugins, custom animations, and Inter font family setup.",
  "project_state.json": "Project metadata tracking a media sharing app migration from Arweave to ICP storage, with chunked uploads up to 2MB, private-by-default files, and shareable links functionality."
}