{
  "backend/main.mo": "Main backend actor implementing file upload/download with chunked storage, user profiles, access control via mixins, and file sharing functionality with metadata tracking and authorization checks.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: diagnosing/fixing 'Actor not available' error and restoring file picker upload functionality for images/videos up to 2MB.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the React app structure with TanStack Router, authentication, file upload/sharing UI, and styling with purple/violet OKLCH color palette.",
  "frontend/index.css": "Empty CSS file (content truncated or removed).",
  "frontend/index.html": "HTML entry point with LookyLoo title, favicon reference to generated 32x32 PNG, and React root mounting point.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for upload, my-uploads, and share pages, wrapped in ThemeProvider with AuthGate protection and Toaster notifications.",
  "frontend/src/components/auth/AuthGate.tsx": "Route guard component that displays login card with animated LookyLoo video for unauthenticated users, or renders children for authenticated users with loading states.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity with loading states, query cache clearing on logout, and 'Sign in or create IID2' text.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog prompting new users to enter their display name on first login, with non-dismissible UI and loading state handling during profile save.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper with header containing circular logo image, navigation buttons for upload/my-uploads, login button, profile setup modal, and footer with GeekGoat logo and social links.",
  "frontend/src/components/upload/KeyfilePicker.tsx": "Empty component file (content truncated or removed).",
  "frontend/src/components/uploads/UploadsList.tsx": "React component that displays a list of uploaded files with metadata (filename, size, type, date, download count), provides copy-to-clipboard share links, delete confirmation dialogs, and navigation to file details.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creates authenticated or anonymous actors based on Internet Identity, initializes access control with admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence via AuthClient, and providing login/logout functions with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for backend operations including user profile management, file uploads with chunking (500KB chunks), fetching uploads, file metadata retrieval, chunk fetching, download count incrementing, file deletion, and file sharing.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors (background, foreground, primary, secondary, muted, destructive, borders, charts) using OKLCH color space.",
  "frontend/src/lib/arweaveClient.ts": "Empty file, likely a placeholder for Arweave blockchain integration client.",
  "frontend/src/lib/shareLinks.ts": "Utility function that generates shareable URLs for files by combining the current origin with a share ID path.",
  "frontend/src/lib/utils.ts": "Utility functions including cn() for merging Tailwind classes with clsx and twMerge, and formatBytes() for human-readable file size formatting.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/MyUploadsPage.tsx": "Page component displaying the authenticated user's uploaded files in a card layout with loading states, error handling, and delete functionality using the UploadsList component.",
  "frontend/src/pages/SharePage.tsx": "Public file sharing page that fetches file metadata and chunks by ID from URL params, reassembles chunks into a blob for preview/download, displays file info with badges, handles downloads with count incrementing, and shows image/video previews.",
  "frontend/src/pages/UploadPage.tsx": "React component for file upload page with file picker, validation (2MB max, images/videos only), progress tracking, and shareable link generation using useUploadFile hook and Internet Identity authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, typography/animation plugins, and extended theme including custom colors, border radius, and keyframe animations.",
  "project_state.json": "Project metadata for LookyLoo file upload app documenting known issues with favicon breaking upload functionality ('Actor not available' errors), existing features for file upload/storage, and pending feature requests for display verification and favicon stability."
}