{
  "backend/main.mo": "Main backend actor implementing file upload/download with chunked storage, user profiles, access control via mixins, and share functionality with metadata tracking and permission checks.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of static logo PNG with animated LookyLoo-gif.mp4 video in the hero section of AuthGate component.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, utilities, and configuration for the LookyLoo file sharing application.",
  "frontend/index.css": "Empty CSS file (content removed or relocated to src/index.css).",
  "frontend/index.html": "HTML entry point with title 'LookyLoo' and root div mounting React app from main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for upload, my-uploads, and share pages, wrapped in ThemeProvider with AuthGate protection.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard component displaying login card with animated LookyLoo-gif.mp4 video (scale-150) when unauthenticated, or rendering children when authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component with 'Sign in or create IID2' text, using Internet Identity hook and clearing query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog prompting new users to set display name on first login with non-dismissible UI (showCloseButton=false) and loading states.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component with header containing lookyloo-logo.png in circular container, navigation buttons, login button, ProfileSetupModal, and footer with GeekGoat and social links.",
  "frontend/src/components/upload/KeyfilePicker.tsx": "Empty component file (no content provided).",
  "frontend/src/components/uploads/UploadsList.tsx": "React component that displays a list of uploaded files with metadata (filename, size, type, date, download count), provides copy-share-link and delete actions, and shows an empty state when no uploads exist.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializes access control with an admin token from URL params, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence via AuthClient, and delegation validity checking with configurable idle options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile management, file upload (metadata, chunks, finalization), fetching uploads, retrieving file metadata and chunks, deleting files, and incrementing download counts.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors (background, foreground, primary, secondary, muted, destructive, borders, charts) using OKLCH color space.",
  "frontend/src/lib/arweaveClient.ts": "Empty file, likely a placeholder for future Arweave blockchain integration.",
  "frontend/src/lib/shareLinks.ts": "Utility function that generates shareable URLs for files by combining the current origin with a share ID path.",
  "frontend/src/lib/utils.ts": "Utility functions including cn() for merging Tailwind classes with clsx/twMerge, and formatBytes() for human-readable file size formatting.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/MyUploadsPage.tsx": "Page component displaying the authenticated user's uploaded files in a card layout with loading skeletons, error alerts, and delete functionality via UploadsList component.",
  "frontend/src/pages/SharePage.tsx": "Public file sharing page that fetches file metadata and chunks by ID, reassembles chunks into a blob for preview (images/videos) or download, increments download count, and handles various loading/error states.",
  "frontend/src/pages/UploadPage.tsx": "React component for uploading files (images/videos up to 2MB) with chunked upload, progress tracking, file sharing, and share link generation with copy-to-clipboard functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme settings, typography and animation plugins, and custom keyframes for accordion animations.",
  "project_state.json": "Project metadata tracking one existing feature to replace a static PNG logo with an animated MP4 video in the hero section while maintaining styling."
}