{
  "kind": "build_request",
  "title": "Expand file upload to accept any file type",
  "projectName": "LookyLoo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the file type restriction on the upload page that currently limits uploads to images and videos only, allowing users to upload any file type",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "I only want one thing. Right now it can share media files perfectly. But I'd like it to now share any file."
        ]
      },
      "acceptanceCriteria": [
        "File picker accepts all file types without MIME type restrictions",
        "No validation error appears for non-media files (PDFs, documents, ZIP files, etc.)",
        "The 2MB file size limit remains enforced for all file types"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the upload page UI text and messaging to reflect that any file type can be uploaded, not just media files",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "I only want one thing. Right now it can share media files perfectly. But I'd like it to now share any file."
        ]
      },
      "acceptanceCriteria": [
        "Upload instructions mention 'any file' or 'all file types' instead of 'images and videos'",
        "File type validation messages are removed or updated to be file-type agnostic"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the share page handles preview display appropriately for non-media files by showing file metadata and download button without attempting to render previews for unsupported file types",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ]
      },
      "acceptanceCriteria": [
        "Non-media files (PDFs, documents, etc.) display filename, size, and download button without breaking",
        "Image and video previews continue to work as before",
        "No console errors appear when viewing non-media file share pages"
      ]
    }
  ],
  "constraints": [
    "Maintain the existing 2MB file size limit",
    "Keep all existing file sharing and download functionality intact",
    "Preserve the chunked upload mechanism for backend storage"
  ],
  "nonGoals": [
    "Increasing the file size limit beyond 2MB",
    "Adding file type-specific previews for documents or PDFs",
    "Modifying the backend file storage or chunking logic",
    "Changing the file sharing URL structure or access control"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}