{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Expand file upload to accept any file type",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the file type restriction that limits uploads to images and videos only, allowing any file type",
      "acceptanceCriteria": [
        "File picker accepts all file types without MIME type restrictions",
        "No validation error appears for non-media files (PDFs, documents, ZIP files, etc.)",
        "The 2MB file size limit remains enforced for all file types"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UploadPage.tsx",
          "operation": "modify",
          "description": "Remove the accept='image/*,video/*' attribute from the file input element to allow all file types. Remove or modify the file type validation logic in the handleFileChange handler that currently checks for image or video MIME types and displays 'Please select an image or video file' error. Keep the 2MB size validation intact."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update upload page UI text to reflect that any file type can be uploaded",
      "acceptanceCriteria": [
        "Upload instructions mention 'any file' or 'all file types' instead of 'images and videos'",
        "File type validation messages are removed or updated to be file-type agnostic"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UploadPage.tsx",
          "operation": "modify",
          "description": "Update the page heading from 'Upload & Share Media' to 'Upload & Share Files'. Change the instructional text from 'Select an image or video to share with others' to 'Select any file to share with others'. Update any remaining references to 'media' or 'image/video' to be file-type agnostic."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the share page handles preview display for non-media files with metadata and download button",
      "acceptanceCriteria": [
        "Non-media files (PDFs, documents, etc.) display filename, size, and download button without breaking",
        "Image and video previews continue to work as before",
        "No console errors appear when viewing non-media file share pages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SharePage.tsx",
          "operation": "modify",
          "description": "Modify the preview rendering logic to conditionally display image/video previews only when the contentType starts with 'image/' or 'video/'. For all other file types, display a generic file icon or card showing the filename and file type badge without attempting to render a preview. Ensure the download button and file metadata (size, name, download count) remain visible for all file types. Add error boundary handling to prevent console errors when non-media files are encountered."
        }
      ]
    }
  ]
}