{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Roll back to Version 21",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Revert all changes from Version 22 deployment to restore Version 21 functionality",
      "acceptanceCriteria": [
        "File upload functionality works without 'Actor not available' error",
        "Backend actor is properly accessible from frontend",
        "All features that worked in Version 21 are restored"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Restore Version 21 actor initialization logic to ensure backend actor is properly available before any operations. Review the actor creation flow, authentication handling, and enabled conditions to match the working Version 21 state."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Restore Version 21 query hook implementations for file upload operations. Ensure proper actor availability checks and enabled conditions match the working state before Version 22 changes were introduced."
        },
        {
          "path": "frontend/src/pages/UploadPage.tsx",
          "operation": "modify",
          "description": "Restore Version 21 upload page implementation to ensure proper actor dependency handling and upload flow. Verify all actor calls use the correct patterns that worked in Version 21."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Restore Version 21 application entry point configuration including QueryClientProvider and InternetIdentityProvider setup to match the working initialization sequence."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Restore Version 21 router configuration and route setup to ensure proper component mounting order and authentication flow that enabled working file uploads."
        },
        {
          "path": "frontend/src/components/auth/AuthGate.tsx",
          "operation": "modify",
          "description": "Restore Version 21 authentication guard logic to ensure users are properly authenticated before accessing upload functionality and that actor is available when needed."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Restore Version 21 layout component to match the working application structure and component initialization order."
        }
      ]
    }
  ]
}