{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix file not found error on shared file links - Frontend",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Ensure share link generation and parsing use correct file ID format",
      "acceptanceCriteria": [
        "Share link URL contains the correct file ID parameter",
        "Frontend shareLinks utility generates URLs that match the backend's expected format",
        "SharePage correctly extracts the file ID from the URL and passes it to the retrieval query"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/shareLinks.ts",
          "operation": "modify",
          "description": "Review and verify that generateShareLink correctly formats the share URL with the file ID. Ensure it uses the proper path structure (e.g., /share/:id or #/share/:id) that matches the routing configuration in App.tsx. The function should accept a file ID string and return a complete shareable URL."
        },
        {
          "path": "frontend/src/pages/SharePage.tsx",
          "operation": "modify",
          "description": "Review the file ID extraction logic from the URL route parameters. Ensure the component correctly retrieves the file ID from the route params, handles the case where the ID might be undefined, and passes the correct ID format to the backend query methods (getFileMetadata, getFileChunks, incrementDownloadCount). Add error logging to capture the exact file ID being requested versus what the backend expects. Verify the component handles the query response states appropriately (loading, error, success)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the getFileMetadata and getFileChunks query implementations to ensure they correctly pass the file ID to the backend actor methods. Verify that the query keys include the file ID for proper cache management. Add error handling that logs both the file ID being requested and any error responses from the backend to aid in debugging the file not found issue."
        },
        {
          "path": "frontend/src/components/uploads/UploadsList.tsx",
          "operation": "modify",
          "description": "Review the copy share link functionality to ensure it uses the generateShareLink utility correctly and passes the proper file ID format (metadata.id). Verify that the share link being copied matches the format expected by the SharePage routing."
        }
      ]
    }
  ]
}